{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Geheugen van Nederland\n",
    "### Collectie Rietveld\n",
    "pilot visualisatie van collectie Rietveld linked open data  \n",
    "11/10/2023 (D/M/Y)  \n",
    "Sablina Vis"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Inhoudsopgave"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# https://sparqlwrapper.readthedocs.io/en/latest/main.html\n",
    "# https://pypi.org/project/sparql-dataframe/\n",
    "# pip install git+https://github.com/lawlesst/sparql-dataframe.git\n",
    "import sparql_dataframe\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "# API Rijksmuseum, zie https://data.netwerkdigitaalerfgoed.nl/Rijksmuseum/collection/\n",
    "api_endpoint = \"https://api.data.netwerkdigitaalerfgoed.nl/datasets/Rijksmuseum/collection/services/collection/sparql\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query 1: \n",
    "linkRijksmuseum | ontwerperNaam | voorwerp\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9, 3)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.634201</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Kindertafelstoel voor de familie Van Boven</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.510600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Beugelstoel 3 (Grote Beugelstoel)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.514392</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Mondialstoel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.634201  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.510600  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.514392  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                                      voorwerp  \n",
       "0   Kindertafelstoel voor de familie Van Boven  \n",
       "1                   Leunstoel voor Til Brugman  \n",
       "2  Prototype Beugelstoel 3 (Grote Beugelstoel)  \n",
       "3                       Prototype Mondialstoel  \n",
       "4                                  Beugelstoel  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "\n",
    "\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp \n",
    "\n",
    "WHERE {\n",
    "?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                dc:title ?voorwerp .\n",
    "\n",
    "?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "FILTER(lang(?voorwerp)='nl')\n",
    "FILTER(?ontwerperNaam =\"Rietveld, Gerrit Thomas\"@nl)\n",
    "      \n",
    "}  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "type(df_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "vervolg"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.634201</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Kindertafelstoel voor de familie Van Boven</td>\n",
       "      <td>Hoge kinderstoel bestaande uit een frame van 4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "      <td>Omstreeks 1919 ontwierp Rietveld wat zijn bero...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.510600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Beugelstoel 3 (Grote Beugelstoel)</td>\n",
       "      <td>Hoewel hij nog nauwelijks iets had gebouwd wer...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.514392</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Mondialstoel</td>\n",
       "      <td>In 1957 kregen Gerrit Rietveld en zijn zoon Wi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "      <td>Rietvelds Beugelstoel is het eerste Nederlands...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.634201  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.510600  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.514392  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                                      voorwerp  \\\n",
       "0   Kindertafelstoel voor de familie Van Boven   \n",
       "1                   Leunstoel voor Til Brugman   \n",
       "2  Prototype Beugelstoel 3 (Grote Beugelstoel)   \n",
       "3                       Prototype Mondialstoel   \n",
       "4                                  Beugelstoel   \n",
       "\n",
       "                                        beschrijving  \n",
       "0  Hoge kinderstoel bestaande uit een frame van 4...  \n",
       "1  Omstreeks 1919 ontwierp Rietveld wat zijn bero...  \n",
       "2  Hoewel hij nog nauwelijks iets had gebouwd wer...  \n",
       "3  In 1957 kregen Gerrit Rietveld en zijn zoon Wi...  \n",
       "4  Rietvelds Beugelstoel is het eerste Nederlands...  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "\n",
    "\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp ?beschrijving\n",
    "\n",
    "WHERE {\n",
    "?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                 dc:description ?beschrijving;\n",
    "                 dc:title ?voorwerp .\n",
    "\n",
    "?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "FILTER(lang(?voorwerp)='nl' && lang(?beschrijving)='nl')\n",
    "FILTER(?ontwerperNaam =\"Rietveld, Gerrit Thomas\"@nl)\n",
    "      \n",
    "}  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "type(df_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "vervolg met statement: geef me maar 1 periode als er meerdere zijn."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9, 5)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>sampledPeriode</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.514392</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Mondialstoel</td>\n",
       "      <td>In 1957 kregen Gerrit Rietveld en zijn zoon Wi...</td>\n",
       "      <td>1957</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "      <td>Omstreeks 1919 ontwierp Rietveld wat zijn bero...</td>\n",
       "      <td>1923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.557739</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Zigzagstoel</td>\n",
       "      <td>Vanaf de jaren 20 experimenteerde de architect...</td>\n",
       "      <td>1932</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.577174</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Gedicht Morgenstern</td>\n",
       "      <td>Etiket met de eerste strofe uit het gedicht 'D...</td>\n",
       "      <td>c. 1930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "      <td>Rietvelds Beugelstoel is het eerste Nederlands...</td>\n",
       "      <td>1927</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.514392  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.557739  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.577174  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                     voorwerp  \\\n",
       "0      Prototype Mondialstoel   \n",
       "1  Leunstoel voor Til Brugman   \n",
       "2                 Zigzagstoel   \n",
       "3         Gedicht Morgenstern   \n",
       "4                 Beugelstoel   \n",
       "\n",
       "                                        beschrijving sampledPeriode  \n",
       "0  In 1957 kregen Gerrit Rietveld en zijn zoon Wi...           1957  \n",
       "1  Omstreeks 1919 ontwierp Rietveld wat zijn bero...           1923  \n",
       "2  Vanaf de jaren 20 experimenteerde de architect...           1932  \n",
       "3  Etiket met de eerste strofe uit het gedicht 'D...        c. 1930  \n",
       "4  Rietvelds Beugelstoel is het eerste Nederlands...           1927  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp ?beschrijving (SAMPLE(?periode) AS ?sampledPeriode)\n",
    "\n",
    "WHERE {\n",
    "?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                 dc:description ?beschrijving;\n",
    "                 dc:title ?voorwerp .\n",
    "\n",
    "?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "OPTIONAL{?linkRijksmuseum dct:created ?periode .}\n",
    "\n",
    "FILTER(lang(?voorwerp)='nl' && lang(?beschrijving)='nl')\n",
    "FILTER(?ontwerperNaam =\"Rietveld, Gerrit Thomas\"@nl)\n",
    "      \n",
    "}  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "type(df_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "vervolg: geef 1 periode en 1 locatie als er meerdere zijn."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(10, 8)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>sampledPeriode</th>\n",
       "      <th>sampledLocatie</th>\n",
       "      <th>lat</th>\n",
       "      <th>long</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.634201</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Kindertafelstoel voor de familie Van Boven</td>\n",
       "      <td>Hoge kinderstoel bestaande uit een frame van 4...</td>\n",
       "      <td>1919 - 1923</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Deense stoel</td>\n",
       "      <td>Gerrit Rietveld was één van de eerste Nederlan...</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.574960</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Zigzagstoel met gaten en korte armleggers</td>\n",
       "      <td>In de loop van de jaren 30 ontwierp Rietveld v...</td>\n",
       "      <td>1932</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "      <td>Omstreeks 1919 ontwierp Rietveld wat zijn bero...</td>\n",
       "      <td>1923</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "      <td>Rietvelds Beugelstoel is het eerste Nederlands...</td>\n",
       "      <td>1927</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.634201  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.551717  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.574960  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                                     voorwerp  \\\n",
       "0  Kindertafelstoel voor de familie Van Boven   \n",
       "1                                Deense stoel   \n",
       "2   Zigzagstoel met gaten en korte armleggers   \n",
       "3                  Leunstoel voor Til Brugman   \n",
       "4                                 Beugelstoel   \n",
       "\n",
       "                                        beschrijving sampledPeriode  \\\n",
       "0  Hoge kinderstoel bestaande uit een frame van 4...    1919 - 1923   \n",
       "1  Gerrit Rietveld was één van de eerste Nederlan...    1946 - 1950   \n",
       "2  In de loop van de jaren 30 ontwierp Rietveld v...           1932   \n",
       "3  Omstreeks 1919 ontwierp Rietveld wat zijn bero...           1923   \n",
       "4  Rietvelds Beugelstoel is het eerste Nederlands...           1927   \n",
       "\n",
       "  sampledLocatie        lat      long  \n",
       "0        Utrecht  52.083333  5.133333  \n",
       "1        Utrecht  52.083333  5.133333  \n",
       "2        Utrecht  52.083333  5.133333  \n",
       "3        Utrecht  52.083333  5.133333  \n",
       "4        Utrecht  52.083333  5.133333  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "PREFIX wgs84: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp ?beschrijving \n",
    "  (SAMPLE(?periode) AS ?sampledPeriode) \n",
    "  (SAMPLE(?locatie) AS ?sampledLocatie) ?lat ?long\n",
    "\n",
    "WHERE {\n",
    "  ?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                   dc:description ?beschrijving;\n",
    "                   dc:title ?voorwerp ;\n",
    "                   dct:spatial ?spat.\n",
    "  ?spat skos:prefLabel ?locatie ;\n",
    "        wgs84:lat ?lat ;\n",
    "        wgs84:long ?long.\n",
    "\n",
    "  ?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "  \n",
    "  OPTIONAL {?linkRijksmuseum dct:created ?periode .}\n",
    "  \n",
    "  FILTER(lang(?voorwerp)='nl' && lang(?beschrijving)='nl' && lang(?locatie)='nl' && lang(?periode)='nl')\n",
    "  FILTER(?ontwerperNaam = \"Rietveld, Gerrit Thomas\"@nl)\n",
    "}  \n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query 2: \n",
    "objecten | beschrijving | periode | locatie | lat | long\n",
    "genereert een dataset met objecten die de bovengenoemde properties heeft.\n",
    "\n",
    "properties:  \n",
    "linkRijksmuseum: uri object  \n",
    "periode: vaak geen exacte datum/jaar, of meerdere datums i.e. 'ca 1950' en '1950'  \n",
    "\n",
    "output is alle data beschikbaar. Taal specificatie en id toegevoegd. Hiermee kun je de data goed bekijken en filteren. Ook op replicates en verschillende periodes bij 1 voorwerp. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(192, 15)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>collectie</th>\n",
       "      <th>ontwerper</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>langVoorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>langBeschrijving</th>\n",
       "      <th>locatie</th>\n",
       "      <th>langLocatie</th>\n",
       "      <th>lat</th>\n",
       "      <th>long</th>\n",
       "      <th>periode</th>\n",
       "      <th>langPeriode</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>nl</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>nl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>en</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>nl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>nl</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>en</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Deense stoel</td>\n",
       "      <td>nl</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>nl</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>nl</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            id                                    linkRijksmuseum  \\\n",
       "0  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "1  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "2  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "3  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "4  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "\n",
       "             collectie                                         ontwerper  \\\n",
       "0  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "1  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "2  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "3  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "4  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "\n",
       "             ontwerperNaam      voorwerp langVoorwerp  \\\n",
       "0  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "1  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "2  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "3  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "4  Rietveld, Gerrit Thomas  Deense stoel           nl   \n",
       "\n",
       "                                        beschrijving langBeschrijving  \\\n",
       "0  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "1  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "2  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "3  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "4  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "\n",
       "     locatie langLocatie    lat      long      periode langPeriode  \n",
       "0  Amsterdam          nl  52.35  4.916667  1946 - 1950          nl  \n",
       "1  Amsterdam          en  52.35  4.916667  1946 - 1950          nl  \n",
       "2  Amsterdam          nl  52.35  4.916667  1946 - 1950          en  \n",
       "3  Amsterdam          en  52.35  4.916667  1946 - 1950          en  \n",
       "4  Amsterdam          nl  52.35  4.916667  1946 - 1950          nl  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "PREFIX wgs84: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT ?id ?linkRijksmuseum ?collectie ?ontwerper ?ontwerperNaam \n",
    "?voorwerp (LANG(?voorwerp) AS ?langVoorwerp) \n",
    "?beschrijving (LANG(?beschrijving) AS ?langBeschrijving)\n",
    "?locatie (LANG(?locatie) AS ?langLocatie)\n",
    "?lat ?long\n",
    "?periode (LANG(?periode) AS ?langPeriode)\n",
    "\n",
    "WHERE {\n",
    "  ?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                   dc:title ?voorwerp ;\n",
    "                   dc:identifier ?id ;\n",
    "                   dct:isPartOf ?collectie ;\n",
    "                   dct:spatial ?spat .\n",
    "  OPTIONAL{?linkRijksmuseum dc:description ?beschrijving .} \n",
    "  ?spat skos:prefLabel ?locatie ;  #check beschrijving\n",
    "        wgs84:lat ?lat ;\n",
    "        wgs84:long ?long.\n",
    "  ?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "  OPTIONAL{?linkRijksmuseum dct:created ?periode .} \n",
    "\n",
    "  FILTER(?ontwerperNaam = \"Rietveld, Gerrit Thomas\"@nl)\n",
    "}  \n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query 3 [work in progress]\n",
    "link meerdere datasets, eerste query datastory"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "zoektocht alles Rietveld:  \n",
    "rkd artists: https://data.rkd.nl/artists/66880  [https://linkeddata.cultureelerfgoed.nl/joop-van-der-heiden/ff/]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(8, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>eventLabel</th>\n",
       "      <th>eventStart</th>\n",
       "      <th>eventEnd</th>\n",
       "      <th>eventMedia</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1874</td>\n",
       "      <td>1875</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1919</td>\n",
       "      <td>1919</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1931</td>\n",
       "      <td>1931</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1952</td>\n",
       "      <td>1954</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1956</td>\n",
       "      <td>1958</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   eventLabel  eventStart  eventEnd  \\\n",
       "0         NaN        1874      1875   \n",
       "1         NaN        1919      1919   \n",
       "2         NaN        1931      1931   \n",
       "3         NaN        1952      1954   \n",
       "4         NaN        1956      1958   \n",
       "\n",
       "                                          eventMedia  \n",
       "0  http://commons.wikimedia.org/wiki/Special:File...  \n",
       "1  http://commons.wikimedia.org/wiki/Special:File...  \n",
       "2  http://commons.wikimedia.org/wiki/Special:File...  \n",
       "3  http://commons.wikimedia.org/wiki/Special:File...  \n",
       "4  http://commons.wikimedia.org/wiki/Special:File...  "
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "api_endpoint_2 = \"https://api.linkeddata.cultureelerfgoed.nl/datasets/rce/cho/services/cho/sparql\"\n",
    "# Query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "#+ description: In summary, the query retrieves information about events related to the manufacturing of Dutch national monuments by Rietveld, filters the results based on various criteria, and incorporates data from both the Cultureel Erfgoed dataset and Wikidata.\n",
    "#+ endpoint: https://api.linkeddata.cultureelerfgoed.nl/datasets/rce/cho/services/cho/sparql\n",
    "PREFIX rnce: <https://data.cultureelerfgoed.nl/id/rnce#>\n",
    "PREFIX ceox: <https://linkeddata.cultureelerfgoed.nl/def/ceox#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX owms: <http://standaarden.overheid.nl/owms/terms/>\n",
    "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
    "PREFIX graph: <https://linkeddata.cultureelerfgoed.nl/graph/>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX ceo: <https://linkeddata.cultureelerfgoed.nl/def/ceo#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rn: <https://data.cultureelerfgoed.nl/term/id/rn/>\n",
    "PREFIX overheid: <http://standaarden.overheid.nl/owms/terms/>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "\n",
    "SELECT DISTINCT ?eventLabel ?eventStart ?eventEnd (SAMPLE(?image) AS ?eventMedia)\n",
    "WHERE {\n",
    "  GRAPH graph:instanties-rce {\n",
    "    ?rijksmonument ceo:datumInschrijvingInMonumentenregister ?datumInschrijving.  # Filter by the date of registration in the monument register.\n",
    "    ?rijksmonument ceo:heeftOorspronkelijkeFunctie/ceo:heeftFunctieNaam/skos:prefLabel ?functie.  # Get the preferred label of the original function of the monument.\n",
    "    ?rijksmonument ceo:rijksmonumentnummer ?rijksmonumentnummer.  # Get the monument number.\n",
    "    ?rijksmonument ceo:heeftBasisregistratieRelatie/ceo:heeftProvincie ?prov.  # Get the province of the monument.\n",
    "    ?rijksmonument ceo:heeftOmschrijving/ceo:omschrijving ?omschrijving.  # Get the description of the monument.\n",
    "    ?rijksmonument ceo:heeftOmschrijving/ceo:formeelStandpunt \"1\"^^xsd:boolean.  # Filter by monuments with a formal standpoint of 1.\n",
    "    MINUS { ?rijksmonument ceo:heeftJuridischeStatus rn:3e79bb7c-b459-4998-a9ed-78d91d069227. }  # Exclude monuments with a specific legal status.\n",
    "    OPTIONAL { ?rijksmonument ceo:heeftGeometrie/geo:asWKT ?shape. }  # Get the geometry of the monument as Well-Known Text (WKT).\n",
    "  }\n",
    "  \n",
    "  SERVICE <https://query.wikidata.org/sparql> {\n",
    "    ?wikirm wdt:P1435 wd:Q916333.  # Get the Wikidata item that represents the Dutch national monument.\n",
    "    ?wikirm wdt:P18 ?image.  # Get the image of the monument from Wikidata.\n",
    "    ?wikirm wdt:P359 ?rijksmonumentnummer.  # Match the Wikidata item with the monument number.\n",
    "  }\n",
    "  \n",
    "  ?rijksmonument ceo:heeftGebeurtenis ?gebeurtenis.  # Get the events associated with the monument.\n",
    "  ?gebeurtenis ceo:heeftGebeurtenisNaam/skos:prefLabel ?gebeurtenisNaam.  # Get the preferred label of the event.\n",
    "  ?gebeurtenis ceo:heeftDatering ?datering.  # Get the date associated with the event.\n",
    "  ?datering ceo:heeftBeginDatering ?beginDatering.  # Get the start date of the event.\n",
    "  ?datering ceo:heeftEindDatering ?eindDatering.  # Get the end date of the event.\n",
    "  ?beginDatering ceo:datum ?beginDatum.  # Get the actual date value of the start date.\n",
    "  BIND(year(xsd:dateTime(?beginDatum)) as ?beginBouwjaar)  # Extract the year from the start date.\n",
    "  BIND(CONCAT(STR(?beginBouwjaar)) AS ?eventStart)  # Convert the year to string for display.\n",
    "  ?eindDatering ceo:datum ?eindDatum.  # Get the actual date value of the end date.\n",
    "  BIND(year(xsd:dateTime(?eindDatum)) as ?eindBouwjaar)  # Extract the year from the end date.\n",
    "  BIND(CONCAT(STR(?eindBouwjaar)) AS ?eventEnd)  # Convert the year to string for display.\n",
    "  FILTER (CONTAINS(?gebeurtenisNaam, \"vervaardiging\"))  # Filter events that contain the word \"vervaardiging\" (manufacturing) in their label.\n",
    "    \n",
    "  {\n",
    "    SELECT ?rijksmonument\n",
    "    WHERE {\n",
    "      VALUES ?actor {\n",
    "        \"Rietveld ; Stad Amsterdam\"\n",
    "        \"Rietveld, G.Th. ; Utrecht\"\n",
    "        \"Rietveld, G.T. ; Stad Utrecht\"\n",
    "        \"Rietveld, G. ; Noord-Holland\"\n",
    "      }\n",
    "      ?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor ?actor  # Filter monuments associated with specific actors.\n",
    "    }\n",
    "  }\n",
    "\n",
    "  \n",
    "}\n",
    "ORDER BY DESC(?aantal)  # Order the results by descending number (not defined in the query).\n",
    "LIMIT 100  # Limit the number of results to 100.\n",
    " \n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint_2, query_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Koppeling Datasets"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Dataset 1: Rijksmuseum\n",
    "SERVICE <https://api.data.netwerkdigitaalerfgoed.nl/datasets/Rijksmuseum/collection/services/collection/sparql>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_rijksmuseum = \"\"\"\n",
    "\n",
    "  {  SERVICE <https://api.data.netwerkdigitaalerfgoed.nl/datasets/Rijksmuseum/collection/services/collection/sparql>{\n",
    "  ?linkRijksmuseum dc:creator/skos:prefLabel \"Rietveld, Gerrit Thomas\"@nl;\n",
    "                                                       dc:description ?description;\n",
    "                                                        dct:created ?eventDate;\n",
    "                                                        dc:title ?eventLabel;\n",
    "                                                        dct:spatial ?spat.\n",
    "    filter(lang(?eventLabel)='nl' && lang(?description)='nl'&& lang(?eventDate)='nl')\n",
    "      \n",
    "# filter regex(iri(str(?spat)), \"http://sws.geonames.org\") . \n",
    "    ?spat wgs84:lat ?lat.\n",
    "      ?spat wgs84:long ?long.\n",
    "    \n",
    "   \n",
    "\n",
    "    }\n",
    "\n",
    "   \n",
    "    # BIND(RAND()/200 AS ?rand)\n",
    "   # Bind(xsd:decimal(?longn) as ?wkt1ni)\n",
    "   # Bind(xsd:decimal()+(?rand) as ?wkt) \n",
    "   Bind(bif:st_geomfromtext(concat(\"POINT(\",str(4.885278),\" \", str(52.36), \")\")) as ?shape)\n",
    "\n",
    "   BIND(strdt(concat('<a href=\"',(?linkRijksmuseum),'\" target=\"_blank\">',str(?eventLabel),'</a>', \" uit \", ?eventDate,\".\", '<p>',  ?description),rdf:HTML) AS ?shapeLabel)\n",
    "    Bind(\"orange\" as ?shapeColor)\n",
    "      \n",
    "    filter regex(?eventDate, \"^[0-9]\", \"i\")}\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Dataset 2: instanties-rce"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_rce = \"\"\"\n",
    "{\n",
    "      GRAPH graph:instanties-rce {\n",
    "  ?rijksmonument ceo:heeftOorspronkelijkeFunctie/ceo:heeftFunctieNaam/skos:prefLabel ?functie.\n",
    "  ?rijksmonument ceo:rijksmonumentnummer ?rijksmonumentnummer.\n",
    "  ?rijksmonument ceo:heeftOmschrijving/ceo:omschrijving ?omschrijving.\n",
    "    ?rijksmonument ceo:heeftOmschrijving/ceo:formeelStandpunt \"1\"^^xsd:boolean.\n",
    "       ?rijksmonument ceo:heeftBasisregistratieRelatie/ceo:heeftBAGRelatie/ceo:volledigAdres ?straat .\n",
    "      ?rijksmonument ceo:heeftBasisregistratieRelatie/ceo:heeftBAGRelatie/ceo:woonplaatsnaam \"Utrecht\" .\n",
    "            optional{?rijksmonument ceo:heeftNaam/ceo:naam ?naamrm.}\n",
    "      optional{?rijksmonument ceo:heeftStijlEnCultuur/ceo:heeftStijlEnCultuurNaam/skos:prefLabel ?stijlrm.}\n",
    "  MINUS {?rijksmonument ceo:heeftJuridischeStatus <https://data.cultureelerfgoed.nl/term/id/rn/3e79bb7c-b459-4998-a9ed-78d91d069227>}\n",
    "  OPTIONAL {?rijksmonument ceo:heeftGeometrie/geo:asWKT ?shape.}\n",
    "\n",
    "    \n",
    "    \n",
    "   #selecteer alle monumenten van Rietveld in de actor en beschrijving \n",
    "    {?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor \"Rietveld ; Stad Amsterdam\"}\n",
    "    union\n",
    "        {?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor \"Rietveld, G.Th. ; Utrecht\"}\n",
    "   union\n",
    "   {?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor \"Rietveld, G.T. ; Stad Utrecht\"}\n",
    "     union\n",
    "   {?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor \"Rietveld, G. ; Noord-Holland\"}\n",
    "    union\n",
    "    {Filter regex(?omschrijving, \"gerrit rietveld\", \"i\")}\n",
    "    union\n",
    "    {Filter regex(?omschrijving, \"Th\\\\. Rietveld\", \"i\")}\n",
    "        union\n",
    "    {Filter regex(?omschrijving, \"G\\\\. Rietveld\", \"i\")}\n",
    "            union\n",
    "    {Filter regex(?omschrijving, \"Th\\\\.Rietveld\", \"i\")}\n",
    "    union\n",
    "    {Filter regex(?omschrijving, \"Gerrit Thomas Rietveld\", \"i\")}\n",
    "    union\n",
    "    {Filter regex(?omschrijving, \"Th\\\\.Rietveld\", \"i\")}\n",
    "\n",
    " }\n",
    " \n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Dataset ?: Beeldbank\n",
    "SERVICE  <https://api.data.netwerkdigitaalerfgoed.nl/datasets/hetutrechtsarchief/Beeldbank/services/Beeldbank/sparql> "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_beeldbank = \"\"\"\n",
    "\n",
    " SERVICE  <https://api.data.netwerkdigitaalerfgoed.nl/datasets/hetutrechtsarchief/Beeldbank/services/Beeldbank/sparql> {\n",
    "\t?cho dc:description ?d .\n",
    "    ?cho edm:isShownBy ?img.\n",
    "    Filter contains(?d, \"Rietveld\")\n",
    "    ?cho \t<http://www.europeana.eu/schemas/edm/isShownAt> ?catalogus.\n",
    "    ?cho dc:rights ?rechten\n",
    "  }\n",
    "\n",
    "  Filter contains(?d, ?straat) \n",
    "  Filter contains(?rechten, \"CC\")\n",
    " Bind(replace(str(?functie), \"\\\\(K\\\\)\", \"\", \"i\") as ?f)\n",
    "\n",
    "      BIND(strdt(concat('<img src=\"',str(?img),'\" style=\"max-width: 150px;\">','</a></p>', ?naamrm,'<p>', ?f, ?omschrijving2, \" - rijksmonument \", '<a href=\"https://monumentenregister.cultureelerfgoed.nl/monumenten/',uri(?rijksmonumentnummer),'\" target=\"_blank\">',str(?rijksmonumentnummer),'</a>', '<p>', ?stijlrm,'<p>', \"<a href=\", uri(?catalogus),' \"target=\"_blank\">', \"Foto uit Het Utrechts Archief\"),rdf:HTML) AS ?shapeLabel)\n",
    "    Bind(\"#648fff\" as ?shapeColor)\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Dataset ?: RCE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_4 = \"\"\"\n",
    "GRAPH graph:instanties-rce {\n",
    "  ?rijksmonument ceo:heeftOorspronkelijkeFunctie/ceo:heeftFunctieNaam/skos:prefLabel ?functie.\n",
    "  ?rijksmonument ceo:rijksmonumentnummer ?rijksmonumentnummer.\n",
    "  ?rijksmonument ceo:heeftOmschrijving/ceo:omschrijving ?omschrijving.\n",
    "    ?rijksmonument ceo:heeftOmschrijving/ceo:formeelStandpunt \"1\"^^xsd:boolean.\n",
    "      optional{?rijksmonument ceo:heeftNaam/ceo:naam ?naamrm.}\n",
    "      optional{?rijksmonument ceo:heeftStijlEnCultuur/ceo:heeftStijlEnCultuurNaam/skos:prefLabel ?stijlrm.}\n",
    "  MINUS {?rijksmonument ceo:heeftJuridischeStatus <https://data.cultureelerfgoed.nl/term/id/rn/3e79bb7c-b459-4998-a9ed-78d91d069227>}\n",
    "  OPTIONAL {?rijksmonument ceo:heeftGeometrie/geo:asWKT ?shape.}\n",
    "\n",
    "        \n",
    "   #selecteer alle monumenten van Rietveld in de actor en beschrijving \n",
    "    {?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor \"Rietveld ; Stad Amsterdam\"}\n",
    "    union\n",
    "        {?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor \"Rietveld, G.Th. ; Utrecht\"}\n",
    "   union\n",
    "   {?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor \"Rietveld, G.T. ; Stad Utrecht\"}\n",
    "     union\n",
    "   {?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor \"Rietveld, G. ; Noord-Holland\"}\n",
    "    union\n",
    "    {Filter regex(?omschrijving, \"gerrit rietveld\", \"i\")}\n",
    "    union\n",
    "    {Filter regex(?omschrijving, \"Th\\\\. Rietveld\", \"i\")}\n",
    "        union\n",
    "    {Filter regex(?omschrijving, \"G\\\\. Rietveld\", \"i\")}\n",
    "            union\n",
    "    {Filter regex(?omschrijving, \"Th\\\\.Rietveld\", \"i\")}\n",
    "    union\n",
    "    {Filter regex(?omschrijving, \"Gerrit Thomas Rietveld\", \"i\")}\n",
    "    union\n",
    "    {Filter regex(?omschrijving, \"Th\\\\.Rietveld\", \"i\")}\n",
    "      \n",
    "            Filter(?rijksmonumentnummer != \"18329\")\n",
    "      Filter(?rijksmonumentnummer != \"46957\")\n",
    "      Filter(?rijksmonumentnummer != \"46958\")\n",
    "\n",
    "     # Bind(if(strlen(?stijlrm) > 2, concat(\"Stijl:  \", ?stijlrm), \"\") as ?stijl2) \n",
    "\t\t#Bind(if(strlen(?naamrm) > 2, concat(?naamrm, ' - '), \"\") as ?naamrm2) \n",
    "           Bind(replace(str(?functie), \"\\\\(K\\\\)\", \"\", \"i\") as ?f)\n",
    "       BIND(strdt(concat(?naamrm, '<p>', ?f, \" - rijksmonument \",'<a href=\"https://monumentenregister.cultureelerfgoed.nl/monumenten/',uri(?rijksmonumentnummer),'\" target=\"_blank\">',str(?rijksmonumentnummer),'</a>', '<p>', ?stijlrm),rdf:HTML) AS ?shapeLabel)\n",
    "      Bind(\"#00008B\" as ?shapeColor)\n",
    "     \n",
    "  }\n",
    "      \n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Dataset 3: Het nieuwe instituut\n",
    "SERVICE <https://api.collectiedata.hetnieuweinstituut.nl/datasets/the-other-interface/knowledge-graph/services/knowledge-graph/sparql>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query_hetnieuweinstituut = \"\"\"\n",
    "\n",
    "   ?stuk rico:isAgentAssociatedWithAgent <https://collectiedata.hetnieuweinstituut.nl/id/people/12546> .\n",
    "  ?stuk skos:prefLabel ?naamn.\n",
    "  ?stuk rico:hasRecordSetType/skos:prefLabel ?typen.\n",
    "  ?stuk rico:date/skos:prefLabel ?daten.\n",
    "  ?stuk rico:isOrWasHolderOf/schema:foundingLocation/rdfs:seeAlso ?archiefplek.\n",
    "      ?stuk <https://www.ica.org/standards/RiC/ontology#scopeAndContent> ?scope.\n",
    "Filter(?archiefplek = <http://vocab.getty.edu/tgn/7006792>)\n",
    "  }\n",
    "\n",
    "\n",
    "   Bind(bif:st_geomfromtext(concat(\"POINT(\",str(4.470925),\" \", str(51.914589), \")\")) as ?shape)\n",
    "\n",
    "   BIND(strdt(concat('<a href=\"',(?stuk),'\" target=\"_blank\">', \" \", str(?naamn),'</a>', '<p>', ?typen, \" uit \", ?daten, \".\", '<p>', ?scope),rdf:HTML) AS ?shapeLabel)\n",
    "    Bind(\"#dc267f\" as ?shapeColor)\n",
    "\n",
    "\"\"\""
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
