{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Geheugen van Nederland\n",
    "### Collectie Rietveld\n",
    "pilot visualisatie van collectie Rietveld linked open data  \n",
    "11/10/2023 (D/M/Y)  \n",
    "Sablina Vis"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Inhoudsopgave"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "# https://sparqlwrapper.readthedocs.io/en/latest/main.html\n",
    "# https://pypi.org/project/sparql-dataframe/\n",
    "# pip install git+https://github.com/lawlesst/sparql-dataframe.git\n",
    "import sparql_dataframe\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "metadata": {},
   "outputs": [],
   "source": [
    "# API Rijksmuseum, zie https://data.netwerkdigitaalerfgoed.nl/Rijksmuseum/collection/\n",
    "api_endpoint = \"https://api.data.netwerkdigitaalerfgoed.nl/datasets/Rijksmuseum/collection/services/collection/sparql\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query 1: \n",
    "linkRijksmuseum | ontwerperNaam | voorwerp\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9, 3)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.634201</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Kindertafelstoel voor de familie Van Boven</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.510600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Beugelstoel 3 (Grote Beugelstoel)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.514392</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Mondialstoel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.634201  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.510600  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.514392  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                                      voorwerp  \n",
       "0   Kindertafelstoel voor de familie Van Boven  \n",
       "1                   Leunstoel voor Til Brugman  \n",
       "2  Prototype Beugelstoel 3 (Grote Beugelstoel)  \n",
       "3                       Prototype Mondialstoel  \n",
       "4                                  Beugelstoel  "
      ]
     },
     "execution_count": 69,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "\n",
    "\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp \n",
    "\n",
    "WHERE {\n",
    "?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                dc:title ?voorwerp .\n",
    "\n",
    "?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "FILTER(lang(?voorwerp)='nl')\n",
    "FILTER(?ontwerperNaam =\"Rietveld, Gerrit Thomas\"@nl)\n",
    "      \n",
    "}  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "type(df_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "vervolg"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.634201</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Kindertafelstoel voor de familie Van Boven</td>\n",
       "      <td>Hoge kinderstoel bestaande uit een frame van 4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "      <td>Omstreeks 1919 ontwierp Rietveld wat zijn bero...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.510600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Beugelstoel 3 (Grote Beugelstoel)</td>\n",
       "      <td>Hoewel hij nog nauwelijks iets had gebouwd wer...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.514392</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Mondialstoel</td>\n",
       "      <td>In 1957 kregen Gerrit Rietveld en zijn zoon Wi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "      <td>Rietvelds Beugelstoel is het eerste Nederlands...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.634201  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.510600  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.514392  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                                      voorwerp  \\\n",
       "0   Kindertafelstoel voor de familie Van Boven   \n",
       "1                   Leunstoel voor Til Brugman   \n",
       "2  Prototype Beugelstoel 3 (Grote Beugelstoel)   \n",
       "3                       Prototype Mondialstoel   \n",
       "4                                  Beugelstoel   \n",
       "\n",
       "                                        beschrijving  \n",
       "0  Hoge kinderstoel bestaande uit een frame van 4...  \n",
       "1  Omstreeks 1919 ontwierp Rietveld wat zijn bero...  \n",
       "2  Hoewel hij nog nauwelijks iets had gebouwd wer...  \n",
       "3  In 1957 kregen Gerrit Rietveld en zijn zoon Wi...  \n",
       "4  Rietvelds Beugelstoel is het eerste Nederlands...  "
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "\n",
    "\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp ?beschrijving\n",
    "\n",
    "WHERE {\n",
    "?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                 dc:description ?beschrijving;\n",
    "                 dc:title ?voorwerp .\n",
    "\n",
    "?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "FILTER(lang(?voorwerp)='nl' && lang(?beschrijving)='nl')\n",
    "FILTER(?ontwerperNaam =\"Rietveld, Gerrit Thomas\"@nl)\n",
    "      \n",
    "}  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "type(df_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "vervolg met statement: geef me maar 1 periode als er meerdere zijn."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9, 5)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>sampledPeriode</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.514392</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Mondialstoel</td>\n",
       "      <td>In 1957 kregen Gerrit Rietveld en zijn zoon Wi...</td>\n",
       "      <td>1957</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "      <td>Omstreeks 1919 ontwierp Rietveld wat zijn bero...</td>\n",
       "      <td>1923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.557739</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Zigzagstoel</td>\n",
       "      <td>Vanaf de jaren 20 experimenteerde de architect...</td>\n",
       "      <td>1932</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.577174</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Gedicht Morgenstern</td>\n",
       "      <td>Etiket met de eerste strofe uit het gedicht 'D...</td>\n",
       "      <td>c. 1930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "      <td>Rietvelds Beugelstoel is het eerste Nederlands...</td>\n",
       "      <td>1927</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.514392  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.557739  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.577174  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                     voorwerp  \\\n",
       "0      Prototype Mondialstoel   \n",
       "1  Leunstoel voor Til Brugman   \n",
       "2                 Zigzagstoel   \n",
       "3         Gedicht Morgenstern   \n",
       "4                 Beugelstoel   \n",
       "\n",
       "                                        beschrijving sampledPeriode  \n",
       "0  In 1957 kregen Gerrit Rietveld en zijn zoon Wi...           1957  \n",
       "1  Omstreeks 1919 ontwierp Rietveld wat zijn bero...           1923  \n",
       "2  Vanaf de jaren 20 experimenteerde de architect...           1932  \n",
       "3  Etiket met de eerste strofe uit het gedicht 'D...        c. 1930  \n",
       "4  Rietvelds Beugelstoel is het eerste Nederlands...           1927  "
      ]
     },
     "execution_count": 96,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp ?beschrijving (SAMPLE(?periode) AS ?sampledPeriode)\n",
    "\n",
    "WHERE {\n",
    "?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                 dc:description ?beschrijving;\n",
    "                 dc:title ?voorwerp .\n",
    "\n",
    "?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "OPTIONAL{?linkRijksmuseum dct:created ?periode .}\n",
    "\n",
    "FILTER(lang(?voorwerp)='nl' && lang(?beschrijving)='nl')\n",
    "FILTER(?ontwerperNaam =\"Rietveld, Gerrit Thomas\"@nl)\n",
    "      \n",
    "}  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "type(df_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "vervolg: geef 1 periode en 1 locatie als er meerdere zijn."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(10, 8)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>sampledPeriode</th>\n",
       "      <th>sampledLocatie</th>\n",
       "      <th>lat</th>\n",
       "      <th>long</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.634201</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Kindertafelstoel voor de familie Van Boven</td>\n",
       "      <td>Hoge kinderstoel bestaande uit een frame van 4...</td>\n",
       "      <td>1919 - 1923</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Deense stoel</td>\n",
       "      <td>Gerrit Rietveld was één van de eerste Nederlan...</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.574960</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Zigzagstoel met gaten en korte armleggers</td>\n",
       "      <td>In de loop van de jaren 30 ontwierp Rietveld v...</td>\n",
       "      <td>1932</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "      <td>Omstreeks 1919 ontwierp Rietveld wat zijn bero...</td>\n",
       "      <td>1923</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "      <td>Rietvelds Beugelstoel is het eerste Nederlands...</td>\n",
       "      <td>1927</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.634201  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.551717  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.574960  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                                     voorwerp  \\\n",
       "0  Kindertafelstoel voor de familie Van Boven   \n",
       "1                                Deense stoel   \n",
       "2   Zigzagstoel met gaten en korte armleggers   \n",
       "3                  Leunstoel voor Til Brugman   \n",
       "4                                 Beugelstoel   \n",
       "\n",
       "                                        beschrijving sampledPeriode  \\\n",
       "0  Hoge kinderstoel bestaande uit een frame van 4...    1919 - 1923   \n",
       "1  Gerrit Rietveld was één van de eerste Nederlan...    1946 - 1950   \n",
       "2  In de loop van de jaren 30 ontwierp Rietveld v...           1932   \n",
       "3  Omstreeks 1919 ontwierp Rietveld wat zijn bero...           1923   \n",
       "4  Rietvelds Beugelstoel is het eerste Nederlands...           1927   \n",
       "\n",
       "  sampledLocatie        lat      long  \n",
       "0        Utrecht  52.083333  5.133333  \n",
       "1        Utrecht  52.083333  5.133333  \n",
       "2        Utrecht  52.083333  5.133333  \n",
       "3        Utrecht  52.083333  5.133333  \n",
       "4        Utrecht  52.083333  5.133333  "
      ]
     },
     "execution_count": 115,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "PREFIX wgs84: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp ?beschrijving \n",
    "  (SAMPLE(?periode) AS ?sampledPeriode) \n",
    "  (SAMPLE(?locatie) AS ?sampledLocatie) ?lat ?long\n",
    "\n",
    "WHERE {\n",
    "  ?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                   dc:description ?beschrijving;\n",
    "                   dc:title ?voorwerp ;\n",
    "                   dct:spatial ?spat.\n",
    "  ?spat skos:prefLabel ?locatie ;\n",
    "        wgs84:lat ?lat ;\n",
    "        wgs84:long ?long.\n",
    "\n",
    "  ?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "  \n",
    "  OPTIONAL {?linkRijksmuseum dct:created ?periode .}\n",
    "  \n",
    "  FILTER(lang(?voorwerp)='nl' && lang(?beschrijving)='nl' && lang(?locatie)='nl' && lang(?periode)='nl')\n",
    "  FILTER(?ontwerperNaam = \"Rietveld, Gerrit Thomas\"@nl)\n",
    "}  \n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query 2: \n",
    "objecten | beschrijving | periode | locatie | lat | long\n",
    "genereert een dataset met objecten die de bovengenoemde properties heeft.\n",
    "\n",
    "properties:  \n",
    "linkRijksmuseum: uri object  \n",
    "periode: vaak geen exacte datum/jaar, of meerdere datums i.e. 'ca 1950' en '1950'  \n",
    "\n",
    "output is alle data beschikbaar. Taal specificatie en id toegevoegd. Hiermee kun je de data goed bekijken en filteren. Ook op replicates en verschillende periodes bij 1 voorwerp. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(192, 15)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>collectie</th>\n",
       "      <th>ontwerper</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>langVoorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>langBeschrijving</th>\n",
       "      <th>locatie</th>\n",
       "      <th>langLocatie</th>\n",
       "      <th>lat</th>\n",
       "      <th>long</th>\n",
       "      <th>periode</th>\n",
       "      <th>langPeriode</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>nl</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>nl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>en</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>nl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>nl</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>en</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Deense stoel</td>\n",
       "      <td>nl</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>nl</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>nl</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            id                                    linkRijksmuseum  \\\n",
       "0  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "1  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "2  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "3  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "4  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "\n",
       "             collectie                                         ontwerper  \\\n",
       "0  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "1  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "2  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "3  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "4  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "\n",
       "             ontwerperNaam      voorwerp langVoorwerp  \\\n",
       "0  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "1  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "2  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "3  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "4  Rietveld, Gerrit Thomas  Deense stoel           nl   \n",
       "\n",
       "                                        beschrijving langBeschrijving  \\\n",
       "0  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "1  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "2  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "3  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "4  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "\n",
       "     locatie langLocatie    lat      long      periode langPeriode  \n",
       "0  Amsterdam          nl  52.35  4.916667  1946 - 1950          nl  \n",
       "1  Amsterdam          en  52.35  4.916667  1946 - 1950          nl  \n",
       "2  Amsterdam          nl  52.35  4.916667  1946 - 1950          en  \n",
       "3  Amsterdam          en  52.35  4.916667  1946 - 1950          en  \n",
       "4  Amsterdam          nl  52.35  4.916667  1946 - 1950          nl  "
      ]
     },
     "execution_count": 127,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "PREFIX wgs84: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT ?id ?linkRijksmuseum ?collectie ?ontwerper ?ontwerperNaam \n",
    "?voorwerp (LANG(?voorwerp) AS ?langVoorwerp) \n",
    "?beschrijving (LANG(?beschrijving) AS ?langBeschrijving)\n",
    "?locatie (LANG(?locatie) AS ?langLocatie)\n",
    "?lat ?long\n",
    "?periode (LANG(?periode) AS ?langPeriode)\n",
    "\n",
    "WHERE {\n",
    "  ?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                   dc:title ?voorwerp ;\n",
    "                   dc:identifier ?id ;\n",
    "                   dct:isPartOf ?collectie ;\n",
    "                   dct:spatial ?spat .\n",
    "  OPTIONAL{?linkRijksmuseum dc:description ?beschrijving .} \n",
    "  ?spat skos:prefLabel ?locatie ;\n",
    "        wgs84:lat ?lat ;\n",
    "        wgs84:long ?long.\n",
    "  ?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "  OPTIONAL{?linkRijksmuseum dct:created ?periode .} \n",
    "\n",
    "  FILTER(?ontwerperNaam = \"Rietveld, Gerrit Thomas\"@nl)\n",
    "}  \n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.4"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
