{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Geheugen van Nederland\n",
    "### Collectie Rietveld\n",
    "pilot visualisatie van collectie Rietveld linked open data  \n",
    "11/10/2023 (D/M/Y)  \n",
    "Sablina Vis"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Inhoudsopgave"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "# https://sparqlwrapper.readthedocs.io/en/latest/main.html\n",
    "# https://pypi.org/project/sparql-dataframe/\n",
    "# install git+https://github.com/lawlesst/sparql-dataframe.git\n",
    "\n",
    "import sparql_dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# API Rijksmuseum, zie https://data.netwerkdigitaalerfgoed.nl/Rijksmuseum/collection/\n",
    "api_endpoint = \"https://api.data.netwerkdigitaalerfgoed.nl/datasets/Rijksmuseum/collection/services/collection/sparql\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query 1: \n",
    "linkRijksmuseum | ontwerperNaam | voorwerp\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9, 3)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.634201</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Kindertafelstoel voor de familie Van Boven</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.510600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Beugelstoel 3 (Grote Beugelstoel)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.514392</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Mondialstoel</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.634201  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.510600  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.514392  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                                      voorwerp  \n",
       "0   Kindertafelstoel voor de familie Van Boven  \n",
       "1                   Leunstoel voor Til Brugman  \n",
       "2  Prototype Beugelstoel 3 (Grote Beugelstoel)  \n",
       "3                       Prototype Mondialstoel  \n",
       "4                                  Beugelstoel  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "\n",
    "\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp \n",
    "\n",
    "WHERE {\n",
    "?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                dc:title ?voorwerp .\n",
    "\n",
    "?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "FILTER(lang(?voorwerp)='nl')\n",
    "FILTER(?ontwerperNaam =\"Rietveld, Gerrit Thomas\"@nl)\n",
    "      \n",
    "}  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "type(df_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "vervolg"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.634201</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Kindertafelstoel voor de familie Van Boven</td>\n",
       "      <td>Hoge kinderstoel bestaande uit een frame van 4...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "      <td>Omstreeks 1919 ontwierp Rietveld wat zijn bero...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.510600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Beugelstoel 3 (Grote Beugelstoel)</td>\n",
       "      <td>Hoewel hij nog nauwelijks iets had gebouwd wer...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.514392</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Mondialstoel</td>\n",
       "      <td>In 1957 kregen Gerrit Rietveld en zijn zoon Wi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "      <td>Rietvelds Beugelstoel is het eerste Nederlands...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.634201  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.510600  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.514392  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                                      voorwerp  \\\n",
       "0   Kindertafelstoel voor de familie Van Boven   \n",
       "1                   Leunstoel voor Til Brugman   \n",
       "2  Prototype Beugelstoel 3 (Grote Beugelstoel)   \n",
       "3                       Prototype Mondialstoel   \n",
       "4                                  Beugelstoel   \n",
       "\n",
       "                                        beschrijving  \n",
       "0  Hoge kinderstoel bestaande uit een frame van 4...  \n",
       "1  Omstreeks 1919 ontwierp Rietveld wat zijn bero...  \n",
       "2  Hoewel hij nog nauwelijks iets had gebouwd wer...  \n",
       "3  In 1957 kregen Gerrit Rietveld en zijn zoon Wi...  \n",
       "4  Rietvelds Beugelstoel is het eerste Nederlands...  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "\n",
    "\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp ?beschrijving\n",
    "\n",
    "WHERE {\n",
    "?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                 dc:description ?beschrijving;\n",
    "                 dc:title ?voorwerp .\n",
    "\n",
    "?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "FILTER(lang(?voorwerp)='nl' && lang(?beschrijving)='nl')\n",
    "FILTER(?ontwerperNaam =\"Rietveld, Gerrit Thomas\"@nl)\n",
    "      \n",
    "}  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "type(df_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "vervolg met statement: geef me maar 1 periode als er meerdere zijn."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(9, 5)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>sampledPeriode</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.514392</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Prototype Mondialstoel</td>\n",
       "      <td>In 1957 kregen Gerrit Rietveld en zijn zoon Wi...</td>\n",
       "      <td>1957</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "      <td>Omstreeks 1919 ontwierp Rietveld wat zijn bero...</td>\n",
       "      <td>1923</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.557739</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Zigzagstoel</td>\n",
       "      <td>Vanaf de jaren 20 experimenteerde de architect...</td>\n",
       "      <td>1932</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.577174</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Gedicht Morgenstern</td>\n",
       "      <td>Etiket met de eerste strofe uit het gedicht 'D...</td>\n",
       "      <td>c. 1930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "      <td>Rietvelds Beugelstoel is het eerste Nederlands...</td>\n",
       "      <td>1927</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.514392  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.557739  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.577174  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                     voorwerp  \\\n",
       "0      Prototype Mondialstoel   \n",
       "1  Leunstoel voor Til Brugman   \n",
       "2                 Zigzagstoel   \n",
       "3         Gedicht Morgenstern   \n",
       "4                 Beugelstoel   \n",
       "\n",
       "                                        beschrijving sampledPeriode  \n",
       "0  In 1957 kregen Gerrit Rietveld en zijn zoon Wi...           1957  \n",
       "1  Omstreeks 1919 ontwierp Rietveld wat zijn bero...           1923  \n",
       "2  Vanaf de jaren 20 experimenteerde de architect...           1932  \n",
       "3  Etiket met de eerste strofe uit het gedicht 'D...        c. 1930  \n",
       "4  Rietvelds Beugelstoel is het eerste Nederlands...           1927  "
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp ?beschrijving (SAMPLE(?periode) AS ?sampledPeriode)\n",
    "\n",
    "WHERE {\n",
    "?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                 dc:description ?beschrijving;\n",
    "                 dc:title ?voorwerp .\n",
    "\n",
    "?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "OPTIONAL{?linkRijksmuseum dct:created ?periode .}\n",
    "\n",
    "FILTER(lang(?voorwerp)='nl' && lang(?beschrijving)='nl')\n",
    "FILTER(?ontwerperNaam =\"Rietveld, Gerrit Thomas\"@nl)\n",
    "      \n",
    "}  \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "type(df_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "vervolg: geef 1 periode en 1 locatie als er meerdere zijn."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(10, 8)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>sampledPeriode</th>\n",
       "      <th>sampledLocatie</th>\n",
       "      <th>lat</th>\n",
       "      <th>long</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.634201</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Kindertafelstoel voor de familie Van Boven</td>\n",
       "      <td>Hoge kinderstoel bestaande uit een frame van 4...</td>\n",
       "      <td>1919 - 1923</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Deense stoel</td>\n",
       "      <td>Gerrit Rietveld was één van de eerste Nederlan...</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.574960</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Zigzagstoel met gaten en korte armleggers</td>\n",
       "      <td>In de loop van de jaren 30 ontwierp Rietveld v...</td>\n",
       "      <td>1932</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.481816</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Leunstoel voor Til Brugman</td>\n",
       "      <td>Omstreeks 1919 ontwierp Rietveld wat zijn bero...</td>\n",
       "      <td>1923</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.516234</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Beugelstoel</td>\n",
       "      <td>Rietvelds Beugelstoel is het eerste Nederlands...</td>\n",
       "      <td>1927</td>\n",
       "      <td>Utrecht</td>\n",
       "      <td>52.083333</td>\n",
       "      <td>5.133333</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     linkRijksmuseum            ontwerperNaam  \\\n",
       "0  http://hdl.handle.net/10934/RM0001.COLLECT.634201  Rietveld, Gerrit Thomas   \n",
       "1  http://hdl.handle.net/10934/RM0001.COLLECT.551717  Rietveld, Gerrit Thomas   \n",
       "2  http://hdl.handle.net/10934/RM0001.COLLECT.574960  Rietveld, Gerrit Thomas   \n",
       "3  http://hdl.handle.net/10934/RM0001.COLLECT.481816  Rietveld, Gerrit Thomas   \n",
       "4  http://hdl.handle.net/10934/RM0001.COLLECT.516234  Rietveld, Gerrit Thomas   \n",
       "\n",
       "                                     voorwerp  \\\n",
       "0  Kindertafelstoel voor de familie Van Boven   \n",
       "1                                Deense stoel   \n",
       "2   Zigzagstoel met gaten en korte armleggers   \n",
       "3                  Leunstoel voor Til Brugman   \n",
       "4                                 Beugelstoel   \n",
       "\n",
       "                                        beschrijving sampledPeriode  \\\n",
       "0  Hoge kinderstoel bestaande uit een frame van 4...    1919 - 1923   \n",
       "1  Gerrit Rietveld was één van de eerste Nederlan...    1946 - 1950   \n",
       "2  In de loop van de jaren 30 ontwierp Rietveld v...           1932   \n",
       "3  Omstreeks 1919 ontwierp Rietveld wat zijn bero...           1923   \n",
       "4  Rietvelds Beugelstoel is het eerste Nederlands...           1927   \n",
       "\n",
       "  sampledLocatie        lat      long  \n",
       "0        Utrecht  52.083333  5.133333  \n",
       "1        Utrecht  52.083333  5.133333  \n",
       "2        Utrecht  52.083333  5.133333  \n",
       "3        Utrecht  52.083333  5.133333  \n",
       "4        Utrecht  52.083333  5.133333  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "PREFIX wgs84: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT DISTINCT ?linkRijksmuseum ?ontwerperNaam ?voorwerp ?beschrijving \n",
    "  (SAMPLE(?periode) AS ?sampledPeriode) \n",
    "  (SAMPLE(?locatie) AS ?sampledLocatie) ?lat ?long\n",
    "\n",
    "WHERE {\n",
    "  ?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                   dc:description ?beschrijving;\n",
    "                   dc:title ?voorwerp ;\n",
    "                   dct:spatial ?spat.\n",
    "  ?spat skos:prefLabel ?locatie ;\n",
    "        wgs84:lat ?lat ;\n",
    "        wgs84:long ?long.\n",
    "\n",
    "  ?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "  \n",
    "  OPTIONAL {?linkRijksmuseum dct:created ?periode .}\n",
    "  \n",
    "  FILTER(lang(?voorwerp)='nl' && lang(?beschrijving)='nl' && lang(?locatie)='nl' && lang(?periode)='nl')\n",
    "  FILTER(?ontwerperNaam = \"Rietveld, Gerrit Thomas\"@nl)\n",
    "}  \n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query 2: \n",
    "objecten | beschrijving | periode | locatie | lat | long\n",
    "genereert een dataset met objecten die de bovengenoemde properties heeft.\n",
    "\n",
    "properties:  \n",
    "linkRijksmuseum: uri object  \n",
    "periode: vaak geen exacte datum/jaar, of meerdere datums i.e. 'ca 1950' en '1950'  \n",
    "\n",
    "output is alle data beschikbaar. Taal specificatie en id toegevoegd. Hiermee kun je de data goed bekijken en filteren. Ook op replicates en verschillende periodes bij 1 voorwerp. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(192, 15)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>linkRijksmuseum</th>\n",
       "      <th>collectie</th>\n",
       "      <th>ontwerper</th>\n",
       "      <th>ontwerperNaam</th>\n",
       "      <th>voorwerp</th>\n",
       "      <th>langVoorwerp</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>langBeschrijving</th>\n",
       "      <th>locatie</th>\n",
       "      <th>langLocatie</th>\n",
       "      <th>lat</th>\n",
       "      <th>long</th>\n",
       "      <th>periode</th>\n",
       "      <th>langPeriode</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>nl</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>nl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>en</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>nl</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>nl</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Danish chair</td>\n",
       "      <td>en</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>en</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>en</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>BK-C-2014-1</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.COLLECT.551717</td>\n",
       "      <td>Collectie: meubelen</td>\n",
       "      <td>http://hdl.handle.net/10934/RM0001.PEOPLE.107600</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>Deense stoel</td>\n",
       "      <td>nl</td>\n",
       "      <td>Gerrit Rietveld was one of the first Dutch des...</td>\n",
       "      <td>en</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>nl</td>\n",
       "      <td>52.35</td>\n",
       "      <td>4.916667</td>\n",
       "      <td>1946 - 1950</td>\n",
       "      <td>nl</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            id                                    linkRijksmuseum  \\\n",
       "0  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "1  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "2  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "3  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "4  BK-C-2014-1  http://hdl.handle.net/10934/RM0001.COLLECT.551717   \n",
       "\n",
       "             collectie                                         ontwerper  \\\n",
       "0  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "1  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "2  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "3  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "4  Collectie: meubelen  http://hdl.handle.net/10934/RM0001.PEOPLE.107600   \n",
       "\n",
       "             ontwerperNaam      voorwerp langVoorwerp  \\\n",
       "0  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "1  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "2  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "3  Rietveld, Gerrit Thomas  Danish chair           en   \n",
       "4  Rietveld, Gerrit Thomas  Deense stoel           nl   \n",
       "\n",
       "                                        beschrijving langBeschrijving  \\\n",
       "0  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "1  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "2  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "3  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "4  Gerrit Rietveld was one of the first Dutch des...               en   \n",
       "\n",
       "     locatie langLocatie    lat      long      periode langPeriode  \n",
       "0  Amsterdam          nl  52.35  4.916667  1946 - 1950          nl  \n",
       "1  Amsterdam          en  52.35  4.916667  1946 - 1950          nl  \n",
       "2  Amsterdam          nl  52.35  4.916667  1946 - 1950          en  \n",
       "3  Amsterdam          en  52.35  4.916667  1946 - 1950          en  \n",
       "4  Amsterdam          nl  52.35  4.916667  1946 - 1950          nl  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "PREFIX wgs84: <http://www.w3.org/2003/01/geo/wgs84_pos#>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX dc: <http://purl.org/dc/elements/1.1/>\n",
    "\n",
    "SELECT ?id ?linkRijksmuseum ?collectie ?ontwerper ?ontwerperNaam \n",
    "?voorwerp (LANG(?voorwerp) AS ?langVoorwerp) \n",
    "?beschrijving (LANG(?beschrijving) AS ?langBeschrijving)\n",
    "?locatie (LANG(?locatie) AS ?langLocatie)\n",
    "?lat ?long\n",
    "?periode (LANG(?periode) AS ?langPeriode)\n",
    "\n",
    "WHERE {\n",
    "  ?linkRijksmuseum dc:creator ?ontwerper ;\n",
    "                   dc:title ?voorwerp ;\n",
    "                   dc:identifier ?id ;\n",
    "                   dct:isPartOf ?collectie ;\n",
    "                   dct:spatial ?spat .\n",
    "  OPTIONAL{?linkRijksmuseum dc:description ?beschrijving .} \n",
    "  ?spat skos:prefLabel ?locatie ;  #check beschrijving\n",
    "        wgs84:lat ?lat ;\n",
    "        wgs84:long ?long.\n",
    "  ?ontwerper skos:prefLabel ?ontwerperNaam .\n",
    "\n",
    "  OPTIONAL{?linkRijksmuseum dct:created ?periode .} \n",
    "\n",
    "  FILTER(?ontwerperNaam = \"Rietveld, Gerrit Thomas\"@nl)\n",
    "}  \n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint, query_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Query 3 [work in progress]\n",
    "link meerdere datasets, eerste query datastory"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "zoektocht alles Rietveld:  \n",
    "rkd artists: https://data.rkd.nl/artists/66880  [https://linkeddata.cultureelerfgoed.nl/joop-van-der-heiden/ff/]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(8, 4)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>eventLabel</th>\n",
       "      <th>eventStart</th>\n",
       "      <th>eventEnd</th>\n",
       "      <th>eventMedia</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1874</td>\n",
       "      <td>1875</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1919</td>\n",
       "      <td>1919</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1931</td>\n",
       "      <td>1931</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1952</td>\n",
       "      <td>1954</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NaN</td>\n",
       "      <td>1956</td>\n",
       "      <td>1958</td>\n",
       "      <td>http://commons.wikimedia.org/wiki/Special:File...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   eventLabel  eventStart  eventEnd  \\\n",
       "0         NaN        1874      1875   \n",
       "1         NaN        1919      1919   \n",
       "2         NaN        1931      1931   \n",
       "3         NaN        1952      1954   \n",
       "4         NaN        1956      1958   \n",
       "\n",
       "                                          eventMedia  \n",
       "0  http://commons.wikimedia.org/wiki/Special:File...  \n",
       "1  http://commons.wikimedia.org/wiki/Special:File...  \n",
       "2  http://commons.wikimedia.org/wiki/Special:File...  \n",
       "3  http://commons.wikimedia.org/wiki/Special:File...  \n",
       "4  http://commons.wikimedia.org/wiki/Special:File...  "
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "api_endpoint_2 = \"https://api.linkeddata.cultureelerfgoed.nl/datasets/rce/cho/services/cho/sparql\"\n",
    "# Query eigenschappen voorwerpen\n",
    "query_obj_creator = \"\"\"\n",
    "#+ description: In summary, the query retrieves information about events related to the manufacturing of Dutch national monuments by Rietveld, filters the results based on various criteria, and incorporates data from both the Cultureel Erfgoed dataset and Wikidata.\n",
    "#+ endpoint: https://api.linkeddata.cultureelerfgoed.nl/datasets/rce/cho/services/cho/sparql\n",
    "PREFIX rnce: <https://data.cultureelerfgoed.nl/id/rnce#>\n",
    "PREFIX ceox: <https://linkeddata.cultureelerfgoed.nl/def/ceox#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX owms: <http://standaarden.overheid.nl/owms/terms/>\n",
    "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
    "PREFIX graph: <https://linkeddata.cultureelerfgoed.nl/graph/>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX ceo: <https://linkeddata.cultureelerfgoed.nl/def/ceo#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rn: <https://data.cultureelerfgoed.nl/term/id/rn/>\n",
    "PREFIX overheid: <http://standaarden.overheid.nl/owms/terms/>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "\n",
    "SELECT DISTINCT ?eventLabel ?eventStart ?eventEnd (SAMPLE(?image) AS ?eventMedia)\n",
    "WHERE {\n",
    "  GRAPH graph:instanties-rce {\n",
    "    ?rijksmonument ceo:datumInschrijvingInMonumentenregister ?datumInschrijving.  # Filter by the date of registration in the monument register.\n",
    "    ?rijksmonument ceo:heeftOorspronkelijkeFunctie/ceo:heeftFunctieNaam/skos:prefLabel ?functie.  # Get the preferred label of the original function of the monument.\n",
    "    ?rijksmonument ceo:rijksmonumentnummer ?rijksmonumentnummer.  # Get the monument number.\n",
    "    ?rijksmonument ceo:heeftBasisregistratieRelatie/ceo:heeftProvincie ?prov.  # Get the province of the monument.\n",
    "    ?rijksmonument ceo:heeftOmschrijving/ceo:omschrijving ?omschrijving.  # Get the description of the monument.\n",
    "    ?rijksmonument ceo:heeftOmschrijving/ceo:formeelStandpunt \"1\"^^xsd:boolean.  # Filter by monuments with a formal standpoint of 1.\n",
    "    MINUS { ?rijksmonument ceo:heeftJuridischeStatus rn:3e79bb7c-b459-4998-a9ed-78d91d069227. }  # Exclude monuments with a specific legal status.\n",
    "    OPTIONAL { ?rijksmonument ceo:heeftGeometrie/geo:asWKT ?shape. }  # Get the geometry of the monument as Well-Known Text (WKT).\n",
    "  }\n",
    "  \n",
    "  SERVICE <https://query.wikidata.org/sparql> {\n",
    "    ?wikirm wdt:P1435 wd:Q916333.  # Get the Wikidata item that represents the Dutch national monument.\n",
    "    ?wikirm wdt:P18 ?image.  # Get the image of the monument from Wikidata.\n",
    "    ?wikirm wdt:P359 ?rijksmonumentnummer.  # Match the Wikidata item with the monument number.\n",
    "  }\n",
    "  \n",
    "  ?rijksmonument ceo:heeftGebeurtenis ?gebeurtenis.  # Get the events associated with the monument.\n",
    "  ?gebeurtenis ceo:heeftGebeurtenisNaam/skos:prefLabel ?gebeurtenisNaam.  # Get the preferred label of the event.\n",
    "  ?gebeurtenis ceo:heeftDatering ?datering.  # Get the date associated with the event.\n",
    "  ?datering ceo:heeftBeginDatering ?beginDatering.  # Get the start date of the event.\n",
    "  ?datering ceo:heeftEindDatering ?eindDatering.  # Get the end date of the event.\n",
    "  ?beginDatering ceo:datum ?beginDatum.  # Get the actual date value of the start date.\n",
    "  BIND(year(xsd:dateTime(?beginDatum)) as ?beginBouwjaar)  # Extract the year from the start date.\n",
    "  BIND(CONCAT(STR(?beginBouwjaar)) AS ?eventStart)  # Convert the year to string for display.\n",
    "  ?eindDatering ceo:datum ?eindDatum.  # Get the actual date value of the end date.\n",
    "  BIND(year(xsd:dateTime(?eindDatum)) as ?eindBouwjaar)  # Extract the year from the end date.\n",
    "  BIND(CONCAT(STR(?eindBouwjaar)) AS ?eventEnd)  # Convert the year to string for display.\n",
    "  FILTER (CONTAINS(?gebeurtenisNaam, \"vervaardiging\"))  # Filter events that contain the word \"vervaardiging\" (manufacturing) in their label.\n",
    "    \n",
    "  {\n",
    "    SELECT ?rijksmonument\n",
    "    WHERE {\n",
    "      VALUES ?actor {\n",
    "        \"Rietveld ; Stad Amsterdam\"\n",
    "        \"Rietveld, G.Th. ; Utrecht\"\n",
    "        \"Rietveld, G.T. ; Stad Utrecht\"\n",
    "        \"Rietveld, G. ; Noord-Holland\"\n",
    "      }\n",
    "      ?rijksmonument ceo:heeftKennisregistratie/ceo:heeftActorEnRol/ceo:heeftActor ?actor  # Filter monuments associated with specific actors.\n",
    "    }\n",
    "  }\n",
    "\n",
    "  \n",
    "}\n",
    "ORDER BY DESC(?aantal)  # Order the results by descending number (not defined in the query).\n",
    "LIMIT 100  # Limit the number of results to 100.\n",
    " \n",
    "\"\"\"\n",
    "\n",
    "df_obj_creator = sparql_dataframe.get(api_endpoint_2, query_obj_creator)\n",
    "print(df_obj_creator.shape)\n",
    "df_obj_creator.head()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Koppeling Datasets"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Dataset 1: Rijksmuseum\n",
    "SERVICE <https://api.data.netwerkdigitaalerfgoed.nl/datasets/Rijksmuseum/collection/services/collection/sparql>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Dataset 2: instanties-rce"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Dataset ?: Beeldbank\n",
    "SERVICE  <https://api.data.netwerkdigitaalerfgoed.nl/datasets/hetutrechtsarchief/Beeldbank/services/Beeldbank/sparql> "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Rietveld Linked Open Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sparql_dataframe"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## RCE: Dataset mogelijk met Rietveld\n",
    "Hier is gezocht voor Rietveld in beschrijvingen en moet nog gematcht worden met rijksmonumenten bekend uit wikidata."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(35, 9)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>rijksmonument</th>\n",
       "      <th>rijksmonumentnummer</th>\n",
       "      <th>collectie</th>\n",
       "      <th>objectType</th>\n",
       "      <th>locatie</th>\n",
       "      <th>geoLocatie</th>\n",
       "      <th>id</th>\n",
       "      <th>datum</th>\n",
       "      <th>beschrijving</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://linkeddata.cultureelerfgoed.nl/cho-ken...</td>\n",
       "      <td>335152.0</td>\n",
       "      <td>rijksmonument</td>\n",
       "      <td>Werk-woonhuis</td>\n",
       "      <td>'s-Gravenhage</td>\n",
       "      <td>POINT(4.3247572139123 52.101652349155)</td>\n",
       "      <td>17810.0</td>\n",
       "      <td>1989-01-26</td>\n",
       "      <td>Volgens de principes van het Nieuwe Bouwen in ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://linkeddata.cultureelerfgoed.nl/cho-ken...</td>\n",
       "      <td>334732.0</td>\n",
       "      <td>rijksmonument</td>\n",
       "      <td>Woonhuis</td>\n",
       "      <td>'s-Gravenhage</td>\n",
       "      <td>POINT(4.3238092047585 52.102848283136)</td>\n",
       "      <td>25773.0</td>\n",
       "      <td>1986-12-17</td>\n",
       "      <td>Volgens de principes van het Nieuwe Bouwen doo...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://linkeddata.cultureelerfgoed.nl/cho-ken...</td>\n",
       "      <td>527848.0</td>\n",
       "      <td>rijksmonument</td>\n",
       "      <td>Kunstacademie</td>\n",
       "      <td>NaN</td>\n",
       "      <td>POINT(4.8946544012722 52.357684812839)</td>\n",
       "      <td>25323.0</td>\n",
       "      <td>2004-12-06</td>\n",
       "      <td>Inleiding\\n\\nHet gebouw van de Rijksacademie v...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://linkeddata.cultureelerfgoed.nl/cho-ken...</td>\n",
       "      <td>408905.0</td>\n",
       "      <td>rijksmonument</td>\n",
       "      <td>Verzekeringskantoor</td>\n",
       "      <td>Amsterdam</td>\n",
       "      <td>POINT(4.8865871947207 52.366216280303)</td>\n",
       "      <td>40141.0</td>\n",
       "      <td>1991-11-13</td>\n",
       "      <td>In 1891 in opdracht van de American Life Insur...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://linkeddata.cultureelerfgoed.nl/cho-ken...</td>\n",
       "      <td>332570.0</td>\n",
       "      <td>rijksmonument</td>\n",
       "      <td>Woonhuis(K)</td>\n",
       "      <td>Blaricum</td>\n",
       "      <td>POINT(5.2348743261236 52.277335797957)</td>\n",
       "      <td>50603.0</td>\n",
       "      <td>1986-12-31</td>\n",
       "      <td>Volgens de principes van het Nieuwe Bouwen doo...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       rijksmonument  rijksmonumentnummer  \\\n",
       "0  https://linkeddata.cultureelerfgoed.nl/cho-ken...             335152.0   \n",
       "1  https://linkeddata.cultureelerfgoed.nl/cho-ken...             334732.0   \n",
       "2  https://linkeddata.cultureelerfgoed.nl/cho-ken...             527848.0   \n",
       "3  https://linkeddata.cultureelerfgoed.nl/cho-ken...             408905.0   \n",
       "4  https://linkeddata.cultureelerfgoed.nl/cho-ken...             332570.0   \n",
       "\n",
       "       collectie           objectType        locatie  \\\n",
       "0  rijksmonument        Werk-woonhuis  's-Gravenhage   \n",
       "1  rijksmonument             Woonhuis  's-Gravenhage   \n",
       "2  rijksmonument        Kunstacademie            NaN   \n",
       "3  rijksmonument  Verzekeringskantoor      Amsterdam   \n",
       "4  rijksmonument          Woonhuis(K)       Blaricum   \n",
       "\n",
       "                               geoLocatie       id       datum  \\\n",
       "0  POINT(4.3247572139123 52.101652349155)  17810.0  1989-01-26   \n",
       "1  POINT(4.3238092047585 52.102848283136)  25773.0  1986-12-17   \n",
       "2  POINT(4.8946544012722 52.357684812839)  25323.0  2004-12-06   \n",
       "3  POINT(4.8865871947207 52.366216280303)  40141.0  1991-11-13   \n",
       "4  POINT(5.2348743261236 52.277335797957)  50603.0  1986-12-31   \n",
       "\n",
       "                                        beschrijving  \n",
       "0  Volgens de principes van het Nieuwe Bouwen in ...  \n",
       "1  Volgens de principes van het Nieuwe Bouwen doo...  \n",
       "2  Inleiding\\n\\nHet gebouw van de Rijksacademie v...  \n",
       "3  In 1891 in opdracht van de American Life Insur...  \n",
       "4  Volgens de principes van het Nieuwe Bouwen doo...  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "api_RCE1 = \"https://api.linkeddata.cultureelerfgoed.nl/datasets/rce/cho/services/cho/sparql\"\n",
    "\n",
    "query_RCE1 = \"\"\"\n",
    "\n",
    "PREFIX geo: <http://www.opengis.net/ont/geosparql#>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "PREFIX ceo: <https://linkeddata.cultureelerfgoed.nl/def/ceo#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX graph: <https://linkeddata.cultureelerfgoed.nl/graph/>\n",
    "PREFIX geof: <http://www.opengis.net/def/function/geosparql/>\n",
    "\n",
    "\n",
    "SELECT DISTINCT\n",
    "?rijksmonument \n",
    "?rijksmonumentnummer \n",
    "# ?titel\n",
    "?collectie\n",
    "?objectType\n",
    "?locatie\n",
    "?geoLocatie\n",
    "# ?long\n",
    "# ?lat\n",
    "?id\n",
    "# ?creator\n",
    "# ?contributor\n",
    "# ?periode\n",
    "# ?startjaar\n",
    "# ?eindjaar\n",
    "?datum\n",
    "?beschrijving \n",
    "#?afbeelding\n",
    "\n",
    "\n",
    "WHERE{\n",
    " \n",
    " GRAPH graph:instanties-rce {\n",
    "  ?rijksmonument ceo:heeftOorspronkelijkeFunctie/ceo:heeftFunctieNaam/skos:prefLabel ?objectType.\n",
    "  ?rijksmonument ceo:rijksmonumentnummer ?rijksmonumentnummer.\n",
    "  ?rijksmonument ceo:heeftOmschrijving/ceo:omschrijving ?beschrijving.\n",
    "  ?rijksmonument ceo:heeftOmschrijving/ceo:formeelStandpunt \"1\"^^xsd:boolean .\n",
    "OPTIONAL{?rijksmonument ceo:cultuurhistorischObjectnummer ?id .}\n",
    "OPTIONAL{?rijksmonument ceo:heeftLocatieAanduiding/ceo:locatienaam ?locatie .}\n",
    "OPTIONAL{?rijksmonument ceo:datumInschrijvingInMonumentenregister ?datum .}\n",
    "OPTIONAL{?rijksmonument ceo:heeftJuridischeStatus/skos:prefLabel ?collectie . }\n",
    "\n",
    "OPTIONAL {?rijksmonument ceo:heeftGeometrie/geo:asWKT ?geoLocatie.} #MULTIPOLYGON(((5.1485962068792 52.085073758205,5.1485377129388 52.085098805504...\n",
    "\n",
    "MINUS {?rijksmonument ceo:heeftJuridischeStatus <https://data.cultureelerfgoed.nl/term/id/rn/3e79bb7c-b459-4998-a9ed-78d91d069227>}\n",
    "\n",
    "\n",
    "#selecteer alle monumenten van Rietveld in de actor en beschrijving \n",
    "FILTER REGEX(?beschrijving, \"gerrit rietveld | Th. Rietveld | G. Rietveld | Th.Rietveld | Gerrit Thomas Rietveld | G.Th. Rietveld\", \"i\")\n",
    "FILTER(!REGEX(?beschrijving, \"Rietveld College | rietveld college | Rietveld college |rietveldcollege | Rietveldcollege\", \"i\")) \n",
    "\n",
    " }\n",
    "\n",
    "\n",
    "}\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_RCE1 = sparql_dataframe.get(api_RCE1, query_RCE1)\n",
    "print(df_RCE1.shape)\n",
    "df_RCE1.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Het Nieuwe Instituut"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "api_HNI = \"https://api.collectiedata.hetnieuweinstituut.nl/datasets/the-other-interface/knowledge-graph/services/knowledge-graph/sparql\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Het Nieuwe Instituut Datasetmix 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(39, 10)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>rijksmonument</th>\n",
       "      <th>titel</th>\n",
       "      <th>collectie</th>\n",
       "      <th>locatie</th>\n",
       "      <th>id</th>\n",
       "      <th>creator</th>\n",
       "      <th>periode</th>\n",
       "      <th>startjaar</th>\n",
       "      <th>eindjaar</th>\n",
       "      <th>beschrijving</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Werkgroep NOP uit 'De 8': schets Nagele</td>\n",
       "      <td>Schets door G. Rietveld, tekening schaal 1:200...</td>\n",
       "      <td>Rotterdam</td>\n",
       "      <td>EEST9.231</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1948-1948</td>\n",
       "      <td>1948</td>\n",
       "      <td>1948.0</td>\n",
       "      <td>Werkgroep NOP uit 'De 8': schets Nagele</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Werkgroep NOP uit 'De 8': schets Nagele</td>\n",
       "      <td>Schets door G. Rietveld, tekening schaal 1:200...</td>\n",
       "      <td>Rotterdam</td>\n",
       "      <td>EEST9.232</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1948-1948</td>\n",
       "      <td>1948</td>\n",
       "      <td>1948.0</td>\n",
       "      <td>Werkgroep NOP uit 'De 8': schets Nagele</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Werkgroep NOP uit 'De 8': fragment woongebied ...</td>\n",
       "      <td>G. Rietveld: Situatietekening met woning platt...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Rechts onder: NOP-S 17</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>1395x890</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       rijksmonument  \\\n",
       "0  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "1  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "2  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "3                             Rechts onder: NOP-S 17   \n",
       "4                                           1395x890   \n",
       "\n",
       "                                               titel  \\\n",
       "0            Werkgroep NOP uit 'De 8': schets Nagele   \n",
       "1            Werkgroep NOP uit 'De 8': schets Nagele   \n",
       "2  Werkgroep NOP uit 'De 8': fragment woongebied ...   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                           collectie    locatie         id  \\\n",
       "0  Schets door G. Rietveld, tekening schaal 1:200...  Rotterdam  EEST9.231   \n",
       "1  Schets door G. Rietveld, tekening schaal 1:200...  Rotterdam  EEST9.232   \n",
       "2  G. Rietveld: Situatietekening met woning platt...        NaN        NaN   \n",
       "3                                                NaN        NaN        NaN   \n",
       "4                                                NaN        NaN        NaN   \n",
       "\n",
       "                   creator    periode startjaar  eindjaar  \\\n",
       "0  Rietveld, Gerrit Thomas  1948-1948      1948    1948.0   \n",
       "1  Rietveld, Gerrit Thomas  1948-1948      1948    1948.0   \n",
       "2                      NaN        NaN       NaN       NaN   \n",
       "3                      NaN        NaN       NaN       NaN   \n",
       "4                      NaN        NaN       NaN       NaN   \n",
       "\n",
       "                              beschrijving  \n",
       "0  Werkgroep NOP uit 'De 8': schets Nagele  \n",
       "1  Werkgroep NOP uit 'De 8': schets Nagele  \n",
       "2                                      NaN  \n",
       "3                                      NaN  \n",
       "4                                      NaN  "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "query_HNI1 = \"\"\"\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX bif: <http://www.openlinksw.com/schemas/bif#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <https://schema.org/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
    "\n",
    "\n",
    "SELECT DISTINCT\n",
    "?rijksmonument\n",
    "# Rijksmonumentnummer\n",
    "?titel\n",
    "?collectie\n",
    "?locatie\n",
    "# ?geoLocatie\n",
    "# ?long\n",
    "# ?lat\n",
    "?id #geen idee van wat\n",
    "?creator\n",
    "#?contributor\n",
    "?periode\n",
    "?startjaar\n",
    "?eindjaar\n",
    "# ?datum\n",
    "?beschrijving\n",
    "#?afbeelding\n",
    "\n",
    "WHERE{\n",
    "\n",
    "    {SERVICE <https://api.collectiedata.hetnieuweinstituut.nl/datasets/the-other-interface/knowledge-graph/services/knowledge-graph/sparql>{\n",
    "\n",
    " \n",
    " ?rijksmonument rico:isAgentAssociatedWithAgent <https://collectiedata.hetnieuweinstituut.nl/id/people/12546> ;\n",
    "                skos:prefLabel ?beschrijving .\n",
    "OPTIONAL{?rijksmonument rico:titel ?titel .}\n",
    "OPTIONAL{?rijksmonument rico:scopeAndContent ?collectie .}\n",
    "OPTIONAL{?rijksmonument rico:hasOrHadIdentifier/skos:prefLabel ?id .}\n",
    "\n",
    "OPTIONAL{?rijksmonument rico:title ?titel .}\n",
    "OPTIONAL{?rijksmonument rico:isOrWasHolderOf/schema:foundingLocation/rdfs:label ?locatie .}\n",
    "OPTIONAL{?rijksmonument rico:date/skos:prefLabel ?periode.}\n",
    "OPTIONAL{?rijksmonument rico:date/rico:hasBeginningDate ?startjaar.}\n",
    "OPTIONAL{?rijksmonument rico:date/rico:hasEndDate ?eindjaar.}\n",
    "\n",
    "?rijksmonument rico:isAgentAssociatedWithAgent ?urlCreator.\n",
    "OPTIONAL{?urlCreator schema:name ?creator .}\n",
    "FILTER (str(?urlCreator) = \"https://collectiedata.hetnieuweinstituut.nl/id/people/12546\")\n",
    "\n",
    "  }\n",
    "}\n",
    "} \n",
    "\n",
    "\"\"\"\n",
    "df_HNI1 = sparql_dataframe.get(api_HNI, query_HNI1)\n",
    "print(df_HNI1.shape)\n",
    "df_HNI1.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Het Nieuwe Instituut Datasetmix 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(126, 8)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>rijksmonument</th>\n",
       "      <th>titel</th>\n",
       "      <th>collectie</th>\n",
       "      <th>objectType</th>\n",
       "      <th>id</th>\n",
       "      <th>contributor</th>\n",
       "      <th>startjaar</th>\n",
       "      <th>beschrijving</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Rietveld-Schröderhuis in Utrecht; foto van het...</td>\n",
       "      <td>DOES</td>\n",
       "      <td>fotografische afdrukken</td>\n",
       "      <td>DOESAB5308+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1924.0</td>\n",
       "      <td>Zwart-wit foto van een gevelaanzicht met entre...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Rietveld-Schröderhuis in Utrecht; collage van ...</td>\n",
       "      <td>DOES</td>\n",
       "      <td>gouaches (schilderingen)</td>\n",
       "      <td>DOESAB5310+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1924.0</td>\n",
       "      <td>Het interieur van een woonhuis, het Rietveld-S...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Rietveld-Schröderhuis in Utrecht; collage van ...</td>\n",
       "      <td>DOES</td>\n",
       "      <td>fotografische afdrukken</td>\n",
       "      <td>DOESAB5310+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1924.0</td>\n",
       "      <td>Het interieur van een woonhuis, het Rietveld-S...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Rietveld-Schröderhuis in Utrecht; acht foto's ...</td>\n",
       "      <td>DOES</td>\n",
       "      <td>fotografische afdrukken</td>\n",
       "      <td>DOESAB5325+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1924.0</td>\n",
       "      <td>Acht zwart-wit foto's van interieur: keuken-, ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Rietveld Schröderhuis</td>\n",
       "      <td>SAM</td>\n",
       "      <td>tentoonstellingsmaquette</td>\n",
       "      <td>MAQV207</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1980.0</td>\n",
       "      <td>Maquette van het Rietveld-Schröder huis in Utr...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       rijksmonument  \\\n",
       "0  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "1  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "2  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "3  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "4  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "\n",
       "                                               titel collectie  \\\n",
       "0  Rietveld-Schröderhuis in Utrecht; foto van het...      DOES   \n",
       "1  Rietveld-Schröderhuis in Utrecht; collage van ...      DOES   \n",
       "2  Rietveld-Schröderhuis in Utrecht; collage van ...      DOES   \n",
       "3  Rietveld-Schröderhuis in Utrecht; acht foto's ...      DOES   \n",
       "4                              Rietveld Schröderhuis       SAM   \n",
       "\n",
       "                 objectType           id              contributor  startjaar  \\\n",
       "0   fotografische afdrukken  DOESAB5308+  Rietveld, Gerrit Thomas     1924.0   \n",
       "1  gouaches (schilderingen)  DOESAB5310+  Rietveld, Gerrit Thomas     1924.0   \n",
       "2   fotografische afdrukken  DOESAB5310+  Rietveld, Gerrit Thomas     1924.0   \n",
       "3   fotografische afdrukken  DOESAB5325+  Rietveld, Gerrit Thomas     1924.0   \n",
       "4  tentoonstellingsmaquette      MAQV207  Rietveld, Gerrit Thomas     1980.0   \n",
       "\n",
       "                                        beschrijving  \n",
       "0  Zwart-wit foto van een gevelaanzicht met entre...  \n",
       "1  Het interieur van een woonhuis, het Rietveld-S...  \n",
       "2  Het interieur van een woonhuis, het Rietveld-S...  \n",
       "3  Acht zwart-wit foto's van interieur: keuken-, ...  \n",
       "4  Maquette van het Rietveld-Schröder huis in Utr...  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_HNI2 = \"\"\"\n",
    "\n",
    "PREFIX cidoc: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX rel: <http://purl.org/vocab/relationship/>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX bif: <http://www.openlinksw.com/schemas/bif#>\n",
    "PREFIX schema: <https://schema.org/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
    "\n",
    "\n",
    "SELECT DISTINCT\n",
    "?rijksmonument\n",
    "# Rijksmonumentnummer\n",
    "?titel\n",
    "?collectie\n",
    "?objectType\n",
    "# ?locatie onbekend\n",
    "# ?geoLocatie\n",
    "# ?long\n",
    "# ?lat\n",
    "?id #geen idee van wat\n",
    "#?creator\n",
    "?contributor\n",
    "#?periode onbekend\n",
    "?startjaar\n",
    "#?eindjaar\n",
    "# ?datum\n",
    "?beschrijving\n",
    "#?afbeelding onbekend\n",
    "\n",
    "WHERE{\n",
    "\n",
    "    {SERVICE <https://api.collectiedata.hetnieuweinstituut.nl/datasets/the-other-interface/knowledge-graph/services/knowledge-graph/sparql>{\n",
    "\n",
    "?rijksmonument dct:contributor <https://collectiedata.hetnieuweinstituut.nl/id/people/12546> .\n",
    "OPTIONAL{?rijksmonument schema:identifier ?id .}\n",
    "OPTIONAL{?rijksmonument schema:description ?beschrijving .}\n",
    "OPTIONAL{?rijksmonument skos:prefLabel ?titel .}\n",
    "OPTIONAL{?rijksmonument dct:contributor/schema:name ?contributor .}\n",
    "OPTIONAL{?rijksmonument schema:artform/rdfs:label ?objectType .}\n",
    "OPTIONAL{?rijksmonument schema:archivedAt ?collectie .}\n",
    "OPTIONAL{?rijksmonument schema:dateCreated/cidoc:P82a_begin_of_the_begin ?startjaar .}\n",
    "  }\n",
    "}\n",
    "} \n",
    "\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_HNI2 = sparql_dataframe.get(api_HNI, query_HNI2)\n",
    "print(df_HNI2.shape)\n",
    "df_HNI2.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Het Nieuwe Instituut Datasetmix 3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(8, 11)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>rijksmonument</th>\n",
       "      <th>collectie</th>\n",
       "      <th>objectType</th>\n",
       "      <th>locatie</th>\n",
       "      <th>id</th>\n",
       "      <th>creator</th>\n",
       "      <th>periode</th>\n",
       "      <th>startjaar</th>\n",
       "      <th>eindjaar</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>afbeelding</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Collectie Het Nieuwe Instituut, gift Van Moorsel</td>\n",
       "      <td>fotografische afdrukken</td>\n",
       "      <td>Parijs</td>\n",
       "      <td>DOESAB5304+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1923 - 11926</td>\n",
       "      <td>1923.0</td>\n",
       "      <td>11926.0</td>\n",
       "      <td>Hôtel Partuculier; foto van de maquette</td>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Collectie Het Nieuwe Instituut, gift Van Moorsel</td>\n",
       "      <td>fotografische afdrukken</td>\n",
       "      <td>Parijs</td>\n",
       "      <td>DOESAB5303+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1923 - 1926</td>\n",
       "      <td>1923.0</td>\n",
       "      <td>1926.0</td>\n",
       "      <td>Hôtel Partuculier; foto van de maquette</td>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>tekeningen</td>\n",
       "      <td>NaN</td>\n",
       "      <td>RIEZ393-2+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1963 - 1963</td>\n",
       "      <td>1963.0</td>\n",
       "      <td>1963.0</td>\n",
       "      <td>Tekening uitbreiding kunstnijverheidsschool, D...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>tekeningen</td>\n",
       "      <td>NaN</td>\n",
       "      <td>RIEZ88-6</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1957 - 1957</td>\n",
       "      <td>1957.0</td>\n",
       "      <td>1957.0</td>\n",
       "      <td>Tekening Rietveld Akademie, Amsterdam</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>tekeningen</td>\n",
       "      <td>NaN</td>\n",
       "      <td>RIET196-3</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1949 - 1951</td>\n",
       "      <td>1949.0</td>\n",
       "      <td>1951.0</td>\n",
       "      <td>Tekening Mgr. Verriet Instituut, Willemstad, C...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       rijksmonument  \\\n",
       "0  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "1  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "2  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "3  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "4  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "\n",
       "                                          collectie               objectType  \\\n",
       "0  Collectie Het Nieuwe Instituut, gift Van Moorsel  fotografische afdrukken   \n",
       "1  Collectie Het Nieuwe Instituut, gift Van Moorsel  fotografische afdrukken   \n",
       "2                                               NaN               tekeningen   \n",
       "3                                               NaN               tekeningen   \n",
       "4                                               NaN               tekeningen   \n",
       "\n",
       "  locatie           id                  creator       periode  startjaar  \\\n",
       "0  Parijs  DOESAB5304+  Rietveld, Gerrit Thomas  1923 - 11926     1923.0   \n",
       "1  Parijs  DOESAB5303+  Rietveld, Gerrit Thomas   1923 - 1926     1923.0   \n",
       "2     NaN   RIEZ393-2+  Rietveld, Gerrit Thomas   1963 - 1963     1963.0   \n",
       "3     NaN     RIEZ88-6  Rietveld, Gerrit Thomas   1957 - 1957     1957.0   \n",
       "4     NaN    RIET196-3  Rietveld, Gerrit Thomas   1949 - 1951     1949.0   \n",
       "\n",
       "   eindjaar                                       beschrijving  \\\n",
       "0   11926.0            Hôtel Partuculier; foto van de maquette   \n",
       "1    1926.0            Hôtel Partuculier; foto van de maquette   \n",
       "2    1963.0  Tekening uitbreiding kunstnijverheidsschool, D...   \n",
       "3    1957.0              Tekening Rietveld Akademie, Amsterdam   \n",
       "4    1951.0  Tekening Mgr. Verriet Instituut, Willemstad, C...   \n",
       "\n",
       "                                          afbeelding  \n",
       "0  https://collectiedata.hetnieuweinstituut.nl/id...  \n",
       "1  https://collectiedata.hetnieuweinstituut.nl/id...  \n",
       "2                                                NaN  \n",
       "3                                                NaN  \n",
       "4                                                NaN  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_HNI3 = \"\"\"\n",
    "\n",
    "PREFIX cidoc: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX sdo: <https://schema.org/>\n",
    "PREFIX rel: <http://id.loc.gov/vocabulary/relators/>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX bif: <http://www.openlinksw.com/schemas/bif#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <https://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
    "PREFIX people: <https://collectiedata.hetnieuweinstituut.nl/id/people/12546>\n",
    "PREFIX thesau: <https://collectiedata.hetnieuweinstituut.nl/model/con/thesau/>\n",
    "\n",
    "\n",
    "SELECT DISTINCT\n",
    "?rijksmonument\n",
    "# Rijksmonumentnummer\n",
    "#?titel\n",
    "?collectie\n",
    "?objectType\n",
    "?locatie\n",
    "# ?geoLocatie\n",
    "# ?long\n",
    "# ?lat\n",
    "?id #geen idee van wat\n",
    "?creator\n",
    "#?contributor\n",
    "?periode\n",
    "?startjaar\n",
    "?eindjaar\n",
    "# ?datum\n",
    "?beschrijving\n",
    "?afbeelding\n",
    "\n",
    "WHERE{\n",
    "\n",
    "    {SERVICE <https://api.collectiedata.hetnieuweinstituut.nl/datasets/the-other-interface/knowledge-graph/services/knowledge-graph/sparql>{\n",
    "\n",
    "?rijksmonument rel:cre <https://collectiedata.hetnieuweinstituut.nl/id/people/12546> .\n",
    "OPTIONAL{?rijksmonument skos:prefLabel ?beschrijving .}\n",
    "\n",
    "OPTIONAL{?rijksmonument sdo:identifier ?id .}\n",
    "\n",
    "OPTIONAL{?rijksmonument sdo:dateCreated/skos:prefLabel ?periode .}\n",
    "OPTIONAL{?rijksmonument sdo:dateCreated/cidoc:P82a_begin_of_the_begin ?startjaar .}\n",
    "OPTIONAL{?rijksmonument sdo:dateCreated/cidoc:P82b_end_of_the_end ?eindjaar .}\n",
    "OPTIONAL{?rijksmonument sdo:creditText ?collectie .}\n",
    "OPTIONAL{?rijksmonument schema:artform/rdfs:label ?objectType .}\n",
    "OPTIONAL{?rijksmonument schema:locationCreated/rdfs:label ?locatie .}\n",
    "\n",
    "OPTIONAL{?rijksmonument schema:associatedMedia ?afbeelding .}\n",
    "?rijksmonument rel:cre ?urlCreator.\n",
    "OPTIONAL{?urlCreator schema:name ?creator .}\n",
    "FILTER (str(?urlCreator) = \"https://collectiedata.hetnieuweinstituut.nl/id/people/12546\")\n",
    "  }\n",
    "}\n",
    "} \n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_HNI3 = sparql_dataframe.get(api_HNI, query_HNI3)\n",
    "print(df_HNI3.shape)\n",
    "df_HNI3.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Het Nieuwe Instituut Dataset mix 4"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(8, 12)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>rijksmonument</th>\n",
       "      <th>titel</th>\n",
       "      <th>collectie</th>\n",
       "      <th>objectType</th>\n",
       "      <th>locatie</th>\n",
       "      <th>id</th>\n",
       "      <th>creator</th>\n",
       "      <th>periode</th>\n",
       "      <th>startjaar</th>\n",
       "      <th>eindjaar</th>\n",
       "      <th>beschrijving</th>\n",
       "      <th>afbeelding</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Hôtel Partuculier; foto van de maquette</td>\n",
       "      <td>DOES</td>\n",
       "      <td>fotografische afdrukken</td>\n",
       "      <td>Parijs</td>\n",
       "      <td>DOESAB5304+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1923 - 11926</td>\n",
       "      <td>1923.0</td>\n",
       "      <td>11926.0</td>\n",
       "      <td>Zwart-wit foto van gevelaanzicht van een maque...</td>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Hôtel Partuculier; foto van de maquette</td>\n",
       "      <td>DOES</td>\n",
       "      <td>fotografische afdrukken</td>\n",
       "      <td>Parijs</td>\n",
       "      <td>DOESAB5303+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1923 - 1926</td>\n",
       "      <td>1923.0</td>\n",
       "      <td>1926.0</td>\n",
       "      <td>Zwart-wit foto van gevelaanzicht. De maquette ...</td>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Tekening uitbreiding kunstnijverheidsschool, D...</td>\n",
       "      <td>RIEZ</td>\n",
       "      <td>tekeningen</td>\n",
       "      <td>NaN</td>\n",
       "      <td>RIEZ393-2+</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1963 - 1963</td>\n",
       "      <td>1963.0</td>\n",
       "      <td>1963.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Tekening Rietveld Akademie, Amsterdam</td>\n",
       "      <td>RIEZ</td>\n",
       "      <td>tekeningen</td>\n",
       "      <td>NaN</td>\n",
       "      <td>RIEZ88-6</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1957 - 1957</td>\n",
       "      <td>1957.0</td>\n",
       "      <td>1957.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>https://collectiedata.hetnieuweinstituut.nl/id...</td>\n",
       "      <td>Tekening Mgr. Verriet Instituut, Willemstad, C...</td>\n",
       "      <td>RIET</td>\n",
       "      <td>tekeningen</td>\n",
       "      <td>NaN</td>\n",
       "      <td>RIET196-3</td>\n",
       "      <td>Rietveld, Gerrit Thomas</td>\n",
       "      <td>1949 - 1951</td>\n",
       "      <td>1949.0</td>\n",
       "      <td>1951.0</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                       rijksmonument  \\\n",
       "0  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "1  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "2  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "3  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "4  https://collectiedata.hetnieuweinstituut.nl/id...   \n",
       "\n",
       "                                               titel collectie  \\\n",
       "0            Hôtel Partuculier; foto van de maquette      DOES   \n",
       "1            Hôtel Partuculier; foto van de maquette      DOES   \n",
       "2  Tekening uitbreiding kunstnijverheidsschool, D...      RIEZ   \n",
       "3              Tekening Rietveld Akademie, Amsterdam      RIEZ   \n",
       "4  Tekening Mgr. Verriet Instituut, Willemstad, C...      RIET   \n",
       "\n",
       "                objectType locatie           id                  creator  \\\n",
       "0  fotografische afdrukken  Parijs  DOESAB5304+  Rietveld, Gerrit Thomas   \n",
       "1  fotografische afdrukken  Parijs  DOESAB5303+  Rietveld, Gerrit Thomas   \n",
       "2               tekeningen     NaN   RIEZ393-2+  Rietveld, Gerrit Thomas   \n",
       "3               tekeningen     NaN     RIEZ88-6  Rietveld, Gerrit Thomas   \n",
       "4               tekeningen     NaN    RIET196-3  Rietveld, Gerrit Thomas   \n",
       "\n",
       "        periode  startjaar  eindjaar  \\\n",
       "0  1923 - 11926     1923.0   11926.0   \n",
       "1   1923 - 1926     1923.0    1926.0   \n",
       "2   1963 - 1963     1963.0    1963.0   \n",
       "3   1957 - 1957     1957.0    1957.0   \n",
       "4   1949 - 1951     1949.0    1951.0   \n",
       "\n",
       "                                        beschrijving  \\\n",
       "0  Zwart-wit foto van gevelaanzicht van een maque...   \n",
       "1  Zwart-wit foto van gevelaanzicht. De maquette ...   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                          afbeelding  \n",
       "0  https://collectiedata.hetnieuweinstituut.nl/id...  \n",
       "1  https://collectiedata.hetnieuweinstituut.nl/id...  \n",
       "2                                                NaN  \n",
       "3                                                NaN  \n",
       "4                                                NaN  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_HNI4 = \"\"\"\n",
    "\n",
    "PREFIX cidoc: <http://www.cidoc-crm.org/cidoc-crm/>\n",
    "PREFIX sdo: <https://schema.org/>\n",
    "PREFIX rel: <http://purl.org/vocab/relationship/>\n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX bif: <http://www.openlinksw.com/schemas/bif#>\n",
    "PREFIX schema: <https://schema.org/>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX rico: <https://www.ica.org/standards/RiC/ontology#>\n",
    "PREFIX thesau: <https://collectiedata.hetnieuweinstituut.nl/model/con/thesau/>\n",
    "\n",
    "\n",
    "SELECT DISTINCT\n",
    "?rijksmonument\n",
    "# Rijksmonumentnummer\n",
    "?titel\n",
    "?collectie\n",
    "?objectType\n",
    "?locatie\n",
    "# ?geoLocatie\n",
    "# ?long\n",
    "# ?lat\n",
    "?id #geen idee van wat\n",
    "?creator\n",
    "#?contributor\n",
    "?periode\n",
    "?startjaar\n",
    "?eindjaar\n",
    "# ?datum\n",
    "?beschrijving\n",
    "?afbeelding\n",
    "\n",
    "WHERE{\n",
    "\n",
    "    {SERVICE <https://api.collectiedata.hetnieuweinstituut.nl/datasets/the-other-interface/knowledge-graph/services/knowledge-graph/sparql>{\n",
    "\n",
    "?rijksmonument thesau:2109 <https://collectiedata.hetnieuweinstituut.nl/id/people/12546> .\n",
    "OPTIONAL{?rijksmonument schema:abstract ?beschrijving .}\n",
    "OPTIONAL{?rijksmonument schema:identifier ?id .}\n",
    "OPTIONAL{?rijksmonument schema:locationCreated/rdfs:label ?locatie .}\n",
    "OPTIONAL{?rijksmonument sdo:dateCreated/skos:prefLabel ?periode .}\n",
    "OPTIONAL{?rijksmonument sdo:dateCreated/cidoc:P82a_begin_of_the_begin ?startjaar .}\n",
    "OPTIONAL{?rijksmonument sdo:dateCreated/cidoc:P82b_end_of_the_end ?eindjaar .}\n",
    "OPTIONAL{?rijksmonument schema:associatedMedia ?afbeelding .}\n",
    "OPTIONAL{?rijksmonument schema:artform/rdfs:label ?objectType .}\n",
    "OPTIONAL{?rijksmonument schema:archivedAt ?collectie .}\n",
    "OPTIONAL{?rijksmonument skos:prefLabel ?titel .}\n",
    "?rijksmonument thesau:2109 ?urlCreator.\n",
    "OPTIONAL{?urlCreator schema:name ?creator .}\n",
    "FILTER (str(?urlCreator) = \"https://collectiedata.hetnieuweinstituut.nl/id/people/12546\")\n",
    "}\n",
    "    }\n",
    "}\n",
    "\n",
    "\n",
    "\"\"\"\n",
    "\n",
    "df_HNI4 = sparql_dataframe.get(api_HNI, query_HNI4)\n",
    "print(df_HNI4.shape)\n",
    "df_HNI4.head()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.0"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
